archiveLog/60secFirstWrk2Automation/JsonPerfectClientWrk2V1.txt
Running 1m test @ http://169.254.90.222:8081/jsonPerfect
  2 threads and 10 connections
  Thread calibration: mean lat.: 5.789ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 5.661ms, rate sampling interval: 16ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.60ms    1.58ms  19.02ms   73.58%
    Req/Sec   162.70     64.59   333.00     64.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.18ms
 75.000%    6.42ms
 90.000%    7.86ms
 99.000%   10.41ms
 99.900%   13.48ms
 99.990%   16.22ms
 99.999%   19.04ms
100.000%   19.04ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.175     0.000000            1         1.00
       3.985     0.100000         1589         1.11
       4.299     0.200000         3162         1.25
       4.587     0.300000         4739         1.43
       4.871     0.400000         6332         1.67
       5.179     0.500000         7899         2.00
       5.359     0.550000         8697         2.22
       5.563     0.600000         9491         2.50
       5.819     0.650000        10272         2.86
       6.119     0.700000        11062         3.33
       6.423     0.750000        11849         4.00
       6.587     0.775000        12246         4.44
       6.767     0.800000        12636         5.00
       6.963     0.825000        13030         5.71
       7.211     0.850000        13427         6.67
       7.503     0.875000        13818         8.00
       7.667     0.887500        14018         8.89
       7.855     0.900000        14215        10.00
       8.039     0.912500        14411        11.43
       8.279     0.925000        14606        13.33
       8.519     0.937500        14810        16.00
       8.655     0.943750        14905        17.78
       8.791     0.950000        15003        20.00
       8.959     0.956250        15100        22.86
       9.111     0.962500        15198        26.67
       9.319     0.968750        15298        32.00
       9.407     0.971875        15347        35.56
       9.519     0.975000        15397        40.00
       9.631     0.978125        15446        45.71
       9.791     0.981250        15497        53.33
       9.991     0.984375        15545        64.00
      10.063     0.985938        15568        71.11
      10.199     0.987500        15595        80.00
      10.295     0.989062        15618        91.43
      10.487     0.990625        15643       106.67
      10.615     0.992188        15667       128.00
      10.743     0.992969        15679       142.22
      10.879     0.993750        15692       160.00
      10.975     0.994531        15704       182.86
      11.087     0.995313        15716       213.33
      11.183     0.996094        15729       256.00
      11.303     0.996484        15735       284.44
      11.543     0.996875        15741       320.00
      11.631     0.997266        15747       365.71
      11.807     0.997656        15753       426.67
      12.095     0.998047        15760       512.00
      12.263     0.998242        15763       568.89
      12.687     0.998437        15766       640.00
      12.863     0.998633        15769       731.43
      13.191     0.998828        15772       853.33
      13.727     0.999023        15775      1024.00
      14.711     0.999121        15777      1137.78
      14.727     0.999219        15778      1280.00
      15.231     0.999316        15780      1462.86
      15.335     0.999414        15781      1706.67
      15.407     0.999512        15783      2048.00
      15.447     0.999561        15784      2275.56
      15.447     0.999609        15784      2560.00
      15.455     0.999658        15785      2925.71
      15.487     0.999707        15786      3413.33
      16.007     0.999756        15787      4096.00
      16.007     0.999780        15787      4551.11
      16.007     0.999805        15787      5120.00
      16.223     0.999829        15788      5851.43
      16.223     0.999854        15788      6826.67
      16.495     0.999878        15789      8192.00
      16.495     0.999890        15789      9102.22
      16.495     0.999902        15789     10240.00
      16.495     0.999915        15789     11702.86
      16.495     0.999927        15789     13653.33
      19.039     0.999939        15790     16384.00
      19.039     1.000000        15790          inf
#[Mean    =        5.604, StdDeviation   =        1.579]
#[Max     =       19.024, Total count    =        15790]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18962 requests in 1.00m, 126.68MB read
Requests/sec:    315.98
Transfer/sec:      2.11MB